In [26]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.Series([1,NA,3.4,NA,7])
data.dropna() #누락치 제거

0    1.0
2    3.4
4    7.0
dtype: float64

In [27]:
data = pd.DataFrame([[1.,6.5,3.],[1,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
clean = data.dropna()
print(clean)
clean1 = data.dropna(how='all')#전체가 nan일때
print(clean1)
data[4] = NA
data.dropna(axis=1,how='all') #컬럼을 제외시키기

     0    1    2
0  1.0  6.5  3.0
     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [34]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1]= NA #:4번째 행, 1번째 컬럼
df.iloc[:2,2] = NA
df.dropna(thresh=2) #몇개의 이상값이 있는지 알아보기

          0         1         2
2  2.194483       NaN  0.093756
3 -2.999462       NaN  0.324197
4  2.196376 -0.883961  0.129199
5  0.555760  0.415758 -1.205311
6  0.914344 -1.238222 -0.695617

In [39]:
df.fillna(0)#결측치를 채우고싶을때 사용
df.fillna({1:0.5,2:0}) #원하는 값으로 채우기
_ = df.fillna(0,inplace=True) #결과를 무시하고싶을때 _사용, 
df

          0         1         2
0  0.128539  0.000000  0.000000
1 -0.600678  0.000000  0.000000
2  2.194483  0.000000  0.093756
3 -2.999462  0.000000  0.324197
4  2.196376 -0.883961  0.129199
5  0.555760  0.415758 -1.205311
6  0.914344 -1.238222 -0.695617

In [49]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data.duplicated() #중복된값 찾기
data.drop_duplicates() #중복값 제거
data['v'] = range(7)
data.drop_duplicates(['k1']) #k1에 기반해서 걸러내기
data.drop_duplicates(['k1','k2'],keep='last') #keep last옵션 사용시 마지막으로 발견된 값 반환

    k1  k2  v
0  one   1  0
1  two   1  1
2  one   2  2
3  two   3  3
4  one   3  4
6  two   4  6

In [60]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()               
col = data[2]
col[np.abs(col)>3] #절대값 3초과값

data[(np.abs(data)>3).any(axis=1)]

            0         1         2         3
49  -0.567467  3.681876 -1.783550  0.511427
67  -0.981535  0.624472 -3.011480  0.095731
266  0.327085  0.508402 -2.084598  3.175175
295  1.371485 -0.639631 -3.613976  0.679457
432 -2.031948 -0.934942 -3.316158  0.631594
626 -1.102400 -3.641671  0.213940 -0.100094
732  3.207635  1.555077  0.282148 -0.480806
791  4.204500  0.921622  0.660317  0.158593
893 -0.677610 -3.006342 -1.252658 -1.247745
904  0.855535 -0.012312 -0.530626  3.125375